#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
               
Функция СведенияОВнешнейОбработке() Экспорт
	
	//ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("");
	//
	//
	//ПараметрыРегистрации.Вид             = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	//ПараметрыРегистрации.Версия          = "1.4";
	//ПараметрыРегистрации.Безопасныйрежим = Истина;
	//ПараметрыРегистрации.Наименование    = НСтр("ru = 'HTML'");
	//ПараметрыРегистрации.Информация      = НСтр("ru = 'HTML'");
	//
	//Команда = ПараметрыРегистрации.Команды.Добавить();
	//Команда.Идентификатор = "РС_HTML";
	//Команда.Представление = НСтр("ru = 'HTML'");
	//Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	//
	//Возврат ПараметрыРегистрации;
	
КонецФункции
 
#КонецЕсли