
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	НоваяСтрока = Объект.КомментарииИФайлы.Добавить();
	НоваяСтрока.Комментарий = ВыбранноеЗначение.Комментарий;
	
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	
	ОткрытьФорму("Справочник.ЗанятияКурса.Форма.ФормаКомментария", , ЭтотОбъект, КлючУникальности,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти