
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	НоваяСтрока = Объект.КомментарииИФайлы.Добавить();
	НоваяСтрока.Комментарий 	= ВыбранноеЗначение.Комментарий;
	НоваяСтрока.СсылкаНаФайл 	= ВыбранноеЗначение.Файл;
	
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомментарииИФайлы
&НаКлиенте
Процедура КомментарииИФайлыПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.КомментарииИФайлы.ТекущиеДанные;
	ТекущийКомментарий 	=  ТекущиеДанные.Комментарий;
	КомментарииИФайлыПриАктивизацииСтрокиНаСервере(ТекущиеДанные.СсылканаФайл);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	
	ОткрытьФорму("Справочник.ЗанятияКурса.Форма.ФормаКомментария", , ЭтотОбъект, КлючУникальности,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура КомментарииИФайлыПриАктивизацииСтрокиНаСервере(СсылкаНаКартинку)
	ТекущееФото 		= ПолучитьНавигационнуюСсылку(СсылкаНаКартинку, "ФайлХранилище");
КонецПроцедуры
#КонецОбласти
