
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	
	ТекущаяСтрока = Элементы.КомментарииИФайлы.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТекКомментарий = "";
	Иначе
		ТекКомментарий = ТекущаяСтрока.Комментарий;	
	КонецЕсли;
		
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Комментарий",ТекКомментарий);
	
	ОткрытьФорму("Справочник.ЗанятияКурса.Форма.ФормаКомментария", ПараметрыФормы, ,Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры
#КонецОбласти