
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	сНаименование = "№"+Объект.Код+" "+Объект.Наименование;
	
	Структура  = Новый Структура("Наименование", сНаименование);
	
	ТекстHTML = ОбщийМодульНаСервере.СформироватьHTML(Структура);
	
	сТело2 = "";
	
	Для Каждого строкаКоментария из Объект.КомментарииИФайлы Цикл 
		сТело2=сТело2+"<p>";
		сТело2=сТело2+	ОбщийМодульНаСервере.ПолучитьТекстHTMLДляСворачиваемогоТекста("Комментарий 	"+строкаКоментария.НомерСтроки, строкаКоментария.Комментарий);	
		сТело2=сТело2+"</p>";
	КонецЦикла;	
	
	ТекстHTML = ТекстHTML+сТело2;
КонецПроцедуры

&НаКлиенте
Процедура КомментарииИФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры
