
&НаКлиенте
Процедура ДобавитьФайл(Команда)
	ДобавитьФайлы();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлы()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Оповещение  =  Новый ОписаниеОповещения("ОбработатьВыборФайла",   ЭтотОбъект);
		НачатьПомещениеФайла(Оповещение,   ,   ,   Истина,   УникальныйИдентификатор);
	Иначе 
		Оповещение = Новый ОписаниеОповещения("ОтветНаВопросЗаписать", ЭтотОбъект);
		ТекстВопроса = "Элемент не записан, Записать?";                            
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);	
 	КонецЕсли;	
КонецПроцедуры

&НаКлиенте 
Процедура ОтветНаВопросЗаписать(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = КодВозвратаДиалога.Да Тогда
		 ЭтотОбъект.Записать();
		 ДобавитьФайлы();
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	Если Не Результат Тогда
		Возврат; 
	КонецЕсли;
	
	//Получим данные файла
	ОписаниеФайла = Новый Файл(ВыбранноеИмяФайла);
	
	//Сохраним в справочник ХранилищеФайлов
	СсылкаСпрФайл = СохранитьФайлВХранилище(Адрес,Объект.Ссылка,ОписаниеФайла.ИмяБезРасширения);
	
	ЭтаФорма.ОбновитьОтображениеДанных(); 
		
	НовСтрока = Объект.РезультатыДействий.Добавить();
	НовСтрока.СсылкаНаФайл 	= СсылкаСпрФайл;
	НовСтрока.Комментарий 	= "Картинка";
	НовСтрока.ТекДата 		= ТекущаяДата();

	Модифицированность = Истина;
КонецПроцедуры 

&НаСервереБезКонтекста
Функция СохранитьФайлВХранилище(Адрес,Владелец,Имя)
	НовФайл = Справочники.СодержаниеКурсаФайлы.СоздатьЭлемент();
	НовФайл.ВладелецФайла 	= Владелец;
	НовФайл.Наименование 	= Имя;
	НовФайл.ДанныеТекущаяДата = ТекущаяДата();
	НовФайл.ФайлХранилище = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Адрес));
	НовФайл.Записать(); 
	
	Возврат НовФайл.Ссылка;
КонецФункции 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	сЗаголовок1 = ОбщийМодульНаСервере.СформироватьЗаголовок1();
	сШапка 		= ОбщийМодульНаСервере.СформироватьШапку("Наименование курса"); 
	сСтили		= ОбщийМодульНаСервере.ПолучитьСтилиCSSМеню();
	
	сТело2 = "";
	
	СтрТекстHTMLЗадачи = сЗаголовок1+сСтили+сШапка+сТело2; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуИзНавигационной(НС)
    
    ПерваяТочка = Найти(НС, "e1cib/data/");
    ВтораяТочка = Найти(НС, "?ref=");
    
    ПредставлениеТипа   = Сред(НС, ПерваяТочка + 11, ВтораяТочка - ПерваяТочка - 11);
    ШаблонЗначения = ЗначениеВСтрокуВнутр(ПредопределенноеЗначение(ПредставлениеТипа + ".ПустаяСсылка"));
    ЗначениеСсылки = СтрЗаменить(ШаблонЗначения, "00000000000000000000000000000000", Сред(НС, ВтораяТочка + 5));
	
	Ссылка = ЗначениеИзСтрокиВнутр(ЗначениеСсылки);
	
	Возврат Ссылка;
КонецФункции
